---
kind: method
id: M:Autodesk.Revit.DB.ComponentRepeater.GetBasicIEnumerator
source: html/f88e21de-e2b8-571f-5ba3-5cf746506737.htm
---
# Autodesk.Revit.DB.ComponentRepeater.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.